## Production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| add    | `aws_sqs_queue.eks_notification_canada_cadelivery_receipts` |
| update | `aws_wafv2_regex_pattern_set.re_admin`                      |
|        | `module.s3_scan_objects.aws_lambda_function.s3_scan_object` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_sqs_queue.eks_notification_canada_cadelivery_receipts will be created
  + resource "aws_sqs_queue" "eks_notification_canada_cadelivery_receipts" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "eks-notification-canada-cadelivery-receipts"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "production"
        }
      + tags_all                          = {
          + "Environment" = "production"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 310
    }

  # aws_wafv2_regex_pattern_set.re_admin will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "re_admin" {
        id          = "ac161757-5887-4282-a156-7c9bf6afc7b8"
        name        = "re_admin"
        tags        = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "/keep-accurate-contact-information|/maintenez-a-jour-les-coordonnees|/delivery-and-failure|/livraison-reussie-et-echec" -> null
        }
      + regular_expression {
          + regex_string = "/keep-accurate-contact-information|/maintenez-a-jour-les-coordonnees|/delivery-and-failure|/livraison-reussie-et-echec|/system-status|/etat-du-systeme"
        }
        # (9 unchanged blocks hidden)
    }

  # module.s3_scan_objects.aws_lambda_function.s3_scan_object will be updated in-place
  ~ resource "aws_lambda_function" "s3_scan_object" {
        id                             = "s3-scan-object-gc-notify"
      ~ last_modified                  = "2023-05-18T15:48:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "DHJ3p3lp/iUsdHa+AW0S5K/vLOTVNPr6e/deRtYmSFY=" -> "ZD1sYT7qTWBeg/9aMCz7U7W3f9uVOSlAw/cOUOr9sQk="
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "LOG_LEVEL"                   = "DEBUG"
                # (2 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + sqs_eks_notification_canada_cadelivery_receipts_arn = (known after apply)

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 59 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-sms-created-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
